/*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 文件名  ： key
* 作者    ： linxu
* 版本    ： V0.0.1
* 时间    ： 2020/10/27
* 描述    ： key驱动文件
********************************************************************
* 副本
*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>*/
/* 头文件 ----------------------------------------------------------------*/
#include"key.h"                                                            
/* 宏定义 ----------------------------------------------------------------*/
#define KEY1 P0_1
#define KEY2 P2_0
/* 结构体或枚举 ----------------------------------------------------------*/

/* 内部函数声明-----------------------------------------------------------*/

/* 函数 ------------------------------------------------------------------*/


void KeyInit(void)
{
  P0SEL &=0xFD;
  P2SEL &=0xFE;
  
  P0DIR &=0xFD;
  P2DIR &=0xFE;
  
  P0INP &=0xFD;
  P2INP &=0x5E;
}

unsigned char KeyStateGet(unsigned char ucKeyNum)
{ 
  unsigned char unKeyState;
  if(KEY_KEY1_E == ucKeyNum)
  {
    unKeyState = KEY1;
  }
  else if(KEY_KEY2_E == ucKeyNum)
  {
     unKeyState = KEY2;
  }
  else
  {
  }
  return unKeyState;
}